In [3]:
# Import the pandas module and alias it as 'pd'
import pandas as pd
from pathlib import Path

 # Read CSV File

In [4]:
csvpath = Path("./sales.csv")
sales_dataframe = pd.read_csv(csvpath)

 ## Type Checking

In [5]:
# Head check the first five line
sales_dataframe.head()

          FullName                   Email    Zip  SalePrice
0    Elwanda White      alyre2036@live.com   9236      84.33
1   Lyndon Elliott  arrowy1873@outlook.com   1330     879.95
2   Daisey Sellers  toucan2024@outlook.com   7631     907.58
3     Issac Reeves    asarin1958@gmail.com  81168     545.88
4  Bradford Kinney  mibound1801@yandex.com  41721     517.49

In [6]:
# Check type of an element in list_of_numbers
new_csvpath = Path("./sales_no_header.csv")

In [7]:
# Create a Series from the list
no_header_df = pd.read_csv(new_csvpath)
no_header_df.head()

     Elwanda White       alyre2036@live.com   9236   84.33
0   Lyndon Elliott   arrowy1873@outlook.com   1330  879.95
1   Daisey Sellers   toucan2024@outlook.com   7631  907.58
2     Issac Reeves     asarin1958@gmail.com  81168  545.88
3  Bradford Kinney   mibound1801@yandex.com  41721  517.49
4     Fermina Cobb  kingfisher2013@live.com  16625  889.95

# Read the csv file without any header

In [9]:
# Print the Series
new_no_header_data = pd.read_csv(new_csvpath, header=None)
new_no_header_data.head()

                 0                       1      2       3
0    Elwanda White      alyre2036@live.com   9236   84.33
1   Lyndon Elliott  arrowy1873@outlook.com   1330  879.95
2   Daisey Sellers  toucan2024@outlook.com   7631  907.58
3     Issac Reeves    asarin1958@gmail.com  81168  545.88
4  Bradford Kinney  mibound1801@yandex.com  41721  517.49

In [10]:
# Return the data type of the elements in the series
columns = ["Full Name", "Email", "Zip Code", "Sale Price"]
new_no_header_data.columns = columns
new_no_header_data.head()

         Full Name                   Email  Zip Code  Sale Price
0    Elwanda White      alyre2036@live.com      9236       84.33
1   Lyndon Elliott  arrowy1873@outlook.com      1330      879.95
2   Daisey Sellers  toucan2024@outlook.com      7631      907.58
3     Issac Reeves    asarin1958@gmail.com     81168      545.88
4  Bradford Kinney  mibound1801@yandex.com     41721      517.49

# Rename columns usign python dictionaries

In [12]:
# Return the element at index 0 using list syntax
new_no_header_data = new_no_header_data.rename(columns={
    "Full Name": "Name"
})

new_no_header_data.head()

              Name                   Email  Zip Code  Sale Price
0    Elwanda White      alyre2036@live.com      9236       84.33
1   Lyndon Elliott  arrowy1873@outlook.com      1330      879.95
2   Daisey Sellers  toucan2024@outlook.com      7631      907.58
3     Issac Reeves    asarin1958@gmail.com     81168      545.88
4  Bradford Kinney  mibound1801@yandex.com     41721      517.49

 # Fixing Rows

In [13]:
# Get the count of the number of times a value occurs in a Series
sales_dataframe.head()

          FullName                   Email    Zip  SalePrice
0    Elwanda White      alyre2036@live.com   9236      84.33
1   Lyndon Elliott  arrowy1873@outlook.com   1330     879.95
2   Daisey Sellers  toucan2024@outlook.com   7631     907.58
3     Issac Reeves    asarin1958@gmail.com  81168     545.88
4  Bradford Kinney  mibound1801@yandex.com  41721     517.49

In [18]:
# Get the unique values of a Series
date_df = pd.read_csv(csvpath, index_col="Date", parse_dates=True,  infer_datetime_format=True)

In [19]:
# A function to triple any value
date_df.head()


# Apply triple value to series_of_numbers

           Net Sales (mill) Net Income (mill)     EPS
Date
2017-09-30          229,234            48,351   $9.27
2018-09-29          265,595            59,531  $12.01
2019-09-28          260,174            55,256  $11.97

 # Preparing data and formating

In [21]:
# A dictionary of stock values
intem_df = pd.read_csv(Path("./items.csv"))
intem_df.head()

   Item Number  Price   Quantity
0         2468    2.99       250
1         1357     NaN       300
2         9753    3.47       350

In [22]:
intem_df.isnull()

   Item Number  Price   Quantity
0        False   False     False
1        False    True     False
2        False   False     False

In [23]:
# Return the data type of the elements in the series
intem_df.isnull().sum()

Item Number    0
Price          1
Quantity       0
dtype: int64

In [24]:
# Apply float to each item in the series
intem_df.dropna()

   Item Number  Price   Quantity
0         2468    2.99       250
2         9753    3.47       350

In [29]:
# Return the data type of the elements in the series
intem_df.loc[:,"Price"].fillna("0")
intem_df.head()

KeyError: 'Price'

 ## Different Methods to Access Values

In [ ]:
# Access value at index location 0 using iloc

# Access value at index location 0 using list syntax

# Access value at index MSFT

 ## Appending Data to Series

In [ ]:
# Create a new stock series for google stock. The dictionary is passed in directly.

In [ ]:
# Append the new data without reassignment

In [ ]:
# Append the new data with reassignment

 ## Removing Data from Series

In [ ]:
# Drop MSFT in-place

 ## Updating Series Data

In [ ]:
# Update using list syntax

In [ ]:
# Update using named index label

 ## Iterating Over Series

In [ ]:
# Print prices

In [ ]:
# Print symbol and price